In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
train_df = pd.DataFrame(pd.read_csv('train.csv'))
test_df = pd.DataFrame(pd.read_csv('test.csv'))

In [3]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#number of NaN values of each cols

for i in train_df.columns:
  print(i,"\t-\t", train_df[i].isna().mean()*100)

PassengerId 	-	 0.0
Survived 	-	 0.0
Pclass 	-	 0.0
Name 	-	 0.0
Sex 	-	 0.0
Age 	-	 19.865319865319865
SibSp 	-	 0.0
Parch 	-	 0.0
Ticket 	-	 0.0
Fare 	-	 0.0
Cabin 	-	 77.10437710437711
Embarked 	-	 0.22446689113355783

In [5]:
#drop cabin cause of most Nan vals

train_df = train_df.drop(["Cabin"], axis=1)

In [6]:
train_df['Age'].fillna(train_df['Age'].median(), inplace=True)#filling Nan values of Age
train_df['Embarked'].fillna(train_df['Embarked'].mode(), inplace=True)

In [7]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [8]:
train_df = train_df.drop(["PassengerId", "Fare", "Ticket", "Name"], axis = 1)

In [9]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Embarked  889 non-null    object
dtypes: float64(1), int64(4), object(2)
memory usage: 48.9+ KB

In [10]:
#str to number values

from sklearn.preprocessing import LabelEncoder

cat_col= train_df.drop(train_df.select_dtypes(exclude=['object']), axis=1).columns
print(cat_col)

enc1 = LabelEncoder()
train_df[cat_col[0]] = enc1.fit_transform(train_df[cat_col[0]].astype('str'))

enc2 = LabelEncoder()
train_df[cat_col[1]] = enc2.fit_transform(train_df[cat_col[1]].astype('str'))

Index(['Sex', 'Embarked'], dtype='object')

In [11]:
train_df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch  Embarked
0         0       3    1  22.0      1      0         2
1         1       1    0  38.0      1      0         0
2         1       3    0  26.0      0      0         2
3         1       1    0  35.0      1      0         2
4         0       3    1  35.0      0      0         2

In [12]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int32
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Embarked  891 non-null    int32
dtypes: float64(1), int32(2), int64(4)
memory usage: 41.9 KB

## Training

In [13]:
X = train_df.drop(['Survived'], axis=1)
y = train_df['Survived']

In [14]:
#now lets split data in test train pairs

from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [30]:
# model training 

from sklearn.linear_model import LogisticRegression

model = LogisticRegression()  
lr = model.fit(X_train, y_train)

## Test

In [16]:
y_pred = model.predict(X_test)

pred_df = pd.DataFrame({'Actual': y_test, 'Predicted': y_pred})
pred_df.head()

     Actual  Predicted
543       1          0
817       0          0
181       0          0
10        1          1
425       0          0

## To check Accuracy

In [33]:
from sklearn import metrics

# Measure the Accuracy Score
print("Accuracy score of the predictions: {0}".format(metrics.accuracy_score(y_pred, y_test)))

Accuracy score of the predictions: 0.7932960893854749

## Prediction

In [18]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [19]:
for i in train_df.columns:
  print(i,"\t-\t", train_df[i].isna().mean()*100)

Survived 	-	 0.0
Pclass 	-	 0.0
Sex 	-	 0.0
Age 	-	 0.0
SibSp 	-	 0.0
Parch 	-	 0.0
Embarked 	-	 0.0

In [20]:
test_df = test_df.drop(["Cabin"], axis=1)

test_df['Age'].fillna(test_df['Age'].median(), inplace=True) #filling Nan values of Age
train_df['Embarked'].fillna(train_df['Embarked'].mode(), inplace=True)

In [21]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          418 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(4)
memory usage: 32.8+ KB

In [22]:
PassengerId = test_df["PassengerId"]

test_df = test_df.drop(["PassengerId", "Fare", "Ticket", "Name"], axis = 1)

In [23]:
test_df[cat_col[0]] = enc1.transform(test_df[cat_col[0]].astype('str'))

test_df[cat_col[1]] = enc2.transform(test_df[cat_col[1]].astype('str'))

In [24]:
test_df.head()

   Pclass  Sex   Age  SibSp  Parch  Embarked
0       3    1  34.5      0      0         1
1       3    0  47.0      1      0         2
2       2    1  62.0      0      0         1
3       3    1  27.0      0      0         2
4       3    0  22.0      1      1         2

In [25]:
y_test_pred = model.predict(test_df)

In [26]:
submission = pd.DataFrame({
        "PassengerId": PassengerId,
        "Survived": y_test_pred
    })


submission.to_csv('./submission.csv', index=False)

In [27]:
final_res =  pd.DataFrame(pd.read_csv('submission.csv'))

In [28]:
final_res.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [29]:
# number of row and cols of a dataframe
row, cols = final_res.shape

row, cols

(418, 2)